dlls/MovieDetailsRequestTemplate.xml

<e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Body><s:SearchWithNifEnabled xmlns:s="http://schemas.microsoft.com/MobileSearch/v1/Search" xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata"><s:request><Context><ApplicationId>%1</ApplicationId><Culture>%4</Culture><UserId>%2</UserId><Version>%3</Version></Context><Queries><QueryInformation><Domains><DomainInformation><Domain>MovieShowtimes</Domain></DomainInformation><DomainInformation><Domain>MovieDetails</Domain></DomainInformation></Domains><Locations><Location><EntityType>Address</EntityType><LocationInformation><Coordinate xmlns:b="http://schemas.microsoft.com/MobileSearch/v1/Common/metadata"><b:Latitude>%6</b:Latitude><b:Longitude>%7</b:Longitude></Coordinate><Offset>0</Offset></LocationInformation></Location></Locations><Properties><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Entertainment.MovieId</Key><Value>%8</Value></KeyValueOfstringstring><KeyValueOfstringstring xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><Key>Entertainment.MovieDetail</Key><Value>Detailed</Value></KeyValueOfstringstring></Properties><QueryString>%5</QueryString></QueryInformation></Queries></s:request></s:SearchWithNifEnabled></e:Body></e:Envelope>
